[{"content":"Welcome to the Factory Optic Documentation Website Home of the SYNCRO-LINK MARK-ZERO ","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://factoryoptic.github.io/public/","publishdate":"2021-03-15T23:37:51Z","title":"_Index"},{"content":"Connections for SYNCRO-LINK  How to hook up your SYNCRO-LINK\nConfiguration How to configure the SYNCRO-LINK for your network\nDisplay How to interpret the SYNCRO-LINK Display\nUnreal Engine How to install plugin for UE\n","date":1615852267,"description":"Text about this post","lastmod":"2021-03-15T23:37:48Z","objectID":"dfae1d937010a359c06f3a1a5f0b3f0a","permalink":"https://factoryoptic.github.io/public/getting-started/","publishdate":"2021-03-15T23:37:51Z","title":"Getting Started"},{"content":"On the side of the SYNCRO-LINK is an microSD slot with a factory installed memory card.\nThe device should contain a card already, but if you need to replace, it should be formatted as FAT32 and can be up to 32GB.\nIn the SD card is a folder named \u0026amp;lsquo;config\u0026amp;rsquo;. Inside this folder is the config files for the network.\nA fresh copy of the SD Card can be found here\nsd card\r| readme.md #this file\r+---config\r|---dest.txt #required\r|---NETWORK.LOG #optional, will be created if missing and appended to if exists\r|---network.txt #required\r|---ntp.txt #optional\r|---stream.txt #optional\rnetwork.txt This is the config file for the SYNCRO-LINK network settings.\nThe file consists of the following 5 lines and can be edited with any text editor.\n Line 1 - IP address for SYNCRO-LINK Line 2 - Network subnet Line 3 - Network DHCP server or Router IP address Line 4 - DNS server Line 5 - static or DHCP  In the case of DHCP, it will initially ignore lines 1-4 and attempt to use them if DHCP fails.\nDHCP can take up to 60 seconds on power-up, so it is recommended that static IP is used.\nBelow is an example network.txt file\n192.168.1.100\r255.255.255.0\r192.168.1.1\r192.168.1.1\rstatic\rdest.txt This is the config file for the destination server, which is the machine running the Unreal Engine plugin or other software that is waiting to accept UDP packets.\nThe file consists of the following 2 lines and can be edited with any text editor.\n Line 1 - Destination IP address for the server Line 2 - UDP port on server to send to (1024 - 65535)  Below is an example dest.txt file\n192.168.1.200\r20000\rntp.txt (optional) The SYNCRO-LINK doesn\u0026amp;rsquo;t contain a battery backed up real time clock, but can connect to an NTP server for getting updated time of day upon powerup. This is not required for operation, but for the LOG file timestamp.\nIf ntp.txt file doesn\u0026amp;rsquo;t exist, SYNCRO-LINK will attempt to obtain time from pool.ntp.org. If SYNCRO-LINK is on an air-gapped network or doesn\u0026amp;rsquo;t have …","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"a5dec696cdd3d4800ae536a04a91e839","permalink":"https://factoryoptic.github.io/public/getting-started/configuration/","publishdate":"2021-03-15T23:37:51Z","title":"Configuration"},{"content":"Connect SYNCRO-LINK  RS232  Connector on SYNCRO-LINK is DTE DE9M, with power on the Ring Indicator (pin 9) Currently supports Cooke /i protocol and Zeiss eXtended data commands   LTC IN (Analog)  BNC Supports SMPTE timecode   SYNC IN (Analog only)  BNC 75Ω impedance input Supports most Bi-level and Tri-Level genlock formats   DC POWER (OPTIONAL)  8-28VDC input @ 4W max   Ethernet/POE  10/100 Mbit Ethernet IEEE 802.3af 4W    LTC and SYNC should be generated by the same device/clock and also be connected to the camera. Use analog D/As if device/clock has insufficient outputs. BNC Tees are discouraged.\nFactory Optic Lens Cable This cable is designed to connect to the RS232 port on the SYNCRO-LINK. The SYNCRO-LINK is wired for standard RS232 for data and signal ground, and DC power is connected to Ring Indicator pin (pin 9). This is required for providing power to the lens data connector.\nThe blue LED on the D-SUB housing indicates the presence of power with the correct polarity.\nThe cable has an internal fuse and reverse polarity protection circuitry to protect the lens from damage.\nTo use the cable with a standard computer RS232 port, a DC input jack is provided on the rear of the D-SUB shell. This jack is a standard DC power jack, 2.1x5.5mm with center pin positive. Digi-Key part # L6R06H-120 2V 6W AC/DC External Wall Mount (Class II) Adapter can be used.\n","date":1615852267,"description":"","lastmod":"2021-06-01T23:37:48Z","objectID":"40187d7ae550505dd4a7d3ebfc4c93e9","permalink":"https://factoryoptic.github.io/public/getting-started/connections/","publishdate":"2021-03-15T23:37:51Z","title":"Connections"},{"content":"SYNCRO-LINK Display The SYNCRO-LINK has an onboard OLED display that displays information.\nPage 1  On the top bar  UDP will indicate whenever UDP packets are streaming, usually takes 45-60 seconds afterbootup if the network settings are correct Firmware version is shown on the right   On the left  ip address of SYNCRO-LINK ip address of destination server port on destination server  DHCP will show next to port if network is configured as DHCP   mac address of SYNCRO-LINK   On the right  LTC/Timecode  This should appear and change every frame when timecode is present When timecode is no longer connected, the last timecode received will show LTC is limited to 30 frames max, but when operating in double-rate video formats, such as 47.96, 48, 50, 59.94 or 60, SYNCRO-LINK will convert UDP packet timecode at the double rate, but the display will only show actual timecode.   SYNC input format  Note, for UHD/4K, cameras will typically accept 1080 formats as Tri-Level sync for resolutions above 1080 do not exist. When SYNC is not present or format is not supported, this line will go blank   Lens Name  This is the name provided by the lens data connection This line will go blank when lens connection is removed   Lens Firmware Version  This will show the current firmware version as reported by the lens     Notes  During boot-up, if no SD card is present, or SD card is missing config files or config files are not properly formatted, message will appear on device \u0026amp;ldquo;SD Card not present\u0026amp;rdquo;  insert card and reboot device      Page 2  On the left  Focus distance Lens t-stop  Readings are displayed in common aperture scale, with tenths resolution between marks. So 4-5 would be a T4 to T5.6 split   Zoom focal length Entrance pupil -this is a signed number, showing the distance of the entrance pupil from the film plane, with negative numbers being behind the film plane.    Page 3  On the left  Lens manufacturer Lens serial number Lens Owner    Page 4   On the left\n PoE Voltage …","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"2e2752ae7db9e954ca772dd82cdb6c66","permalink":"https://factoryoptic.github.io/public/getting-started/display/","publishdate":"2021-03-15T23:37:51Z","title":"Display"},{"content":"At the moment, Factory Optic is working on an Unreal Engine Plugin that supports all the available data from the lens. This will be completed by product launch.\nIn the meantime, we are supporting an Open Source plugin.\nUE4.25 install  Download the 4.25 plugin here: http://loledvirtual.com/documentation/files/unreal/LONET-Unreal-Pluginv1.3.2binaries.zip Create a directory named \u0026amp;lsquo;plugins\u0026amp;rsquo; in your Unreal project folder, if it doesn\u0026amp;rsquo;t already exist Unzip the file to the plugins directory  UE4.26 install  Download the 4.26 plugin here: http://loledvirtual.com/documentation/files/unreal/LONETClient1.4.zip Create a directory named \u0026amp;lsquo;plugins\u0026amp;rsquo; in your Unreal project folder, if it doesn\u0026amp;rsquo;t already exist Unzip the file to the plugins directory  LiveLink  When you launch Unreal, open your project and open Live Link  If Live Link plugin is not installed/enabled, be sure to enable it   Add a source, select the LOLED as the source For the IP:port, you only need to specify the port, for example \u0026amp;lsquo;0.0.0.0:3200\u0026amp;rsquo; At the moment, the limitation will be only Focus, Iris and Zoom positions will be received The packet does support 6 data values to be streamed, so the other 3 values are Entrance Pupil, Near Focus Distance and Far Focus Distance.  ","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"a264d832c80b4aba3524c4cdcc0230c1","permalink":"https://factoryoptic.github.io/public/getting-started/unreal/","publishdate":"2021-03-15T23:37:51Z","title":"Unreal Engine"}]