[{"content":"Welcome to the Factory Optic Documentation Website Always a work in progress ","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"3976528693a0108357f4928017600865","permalink":"http://factoryoptic.github.io/","publishdate":"2021-03-15T23:37:51Z","title":"_Index"},{"content":"Connections for SYNCRO-LINK  How to hook up your SYNCRO-LINK\nConfiguration How to configure the SYNCRO-LINK for your network\nDisplay How to interpret the SYNCRO-LINK Display\nUnreal Engine How to install plugin for UE\n","date":1615852267,"description":"Text about this post","lastmod":"2021-03-15T23:37:48Z","objectID":"dfae1d937010a359c06f3a1a5f0b3f0a","permalink":"http://factoryoptic.github.io/getting-started/","publishdate":"2021-03-15T23:37:51Z","title":"Getting Started"},{"content":"On the side of the SYNCRO-LINK is an microSD slot.\nThe device should contain a card already, but if you need to replace, it should be formatted as FAT32 and can be up to 32GB.\nIn the SD card is a folder named \u0026amp;lsquo;config\u0026amp;rsquo;. Inside this folder is the config files for the network.\nnetwork.txt This is the config file for the device network settings.\nThe file consists of the following 5 lines and can be edited with any text editor.\n Line 1 - IP address for device Line 2 - Network subnet Line 3 - Network Router Line 4 - DNS server Line 5 - static or DHCP  In the case of DHCP, it will initially ignore lines 1-4 and attempt to use them if DHCP fails.\nBe advised, DHCP can take up to 60 seconds on powerup, so it is recommended that static IP is used.\nBelow is an example network.txt file\n192.168.1.174\r255.255.255.0\r192.168.1.1\r192.168.1.1\rstatic\rdest.txt This is the config file for the destination server.\nThe file consists of the following 2 lines and can be edited with any text editor.\n Line 1 - Destination IP address for the server Line 2 - UDP port on server to send to  Below is an example dest.txt file\n192.168.1.191\r3200\r","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"a5dec696cdd3d4800ae536a04a91e839","permalink":"http://factoryoptic.github.io/getting-started/configuration/","publishdate":"2021-03-15T23:37:51Z","title":"Configuration"},{"content":"Connect SYNCRO-LINK  RS232  Connector on SYNCRO-LINK is DTE DE9M, with power on the Ring Indicator (pin 9) Currently only supports Cooke /i protocol and Zeiss eXtended data commands   LTC IN  BNC Supports SMTPE timecode   SYNC IN  BNC Analog video Supports most Bi-level and Tri-Level genlock formats   DC POWER (OPTIONAL)  If installed, will require 8-28VDC @ 4W   Ethernet/POE  10/100 Mbit Ethernet IEEE 802.3af 4W    LTC and SYNC should be generated by the same device/clock and also be connected to the camera. Use analog D/As if device/clock has insufficient outputs. BNC Tees are discouraged.\nFactory Optic Lens Cable This cable is designed to connect to the RS232 port on the SYNCRO-LINK. The SYNCRO-LINK is wired for standard RS232 for data and signal ground, and DC power is connected to Ring Indicator pin (pin 9). This is required for providing power to the lens data connector.\nThe blue LED on the DSUB housing indicates the presence of power with the correct polarity.\nThe cable has an internal fuse and reverse polarity protection circuitry to protect the lens from damage.\nTo use the cable with a standard computer RS232 port, a DC input jack is provided on the rear of the DSUB shell. This jack is a standard DC power jack, 2.1x5.5mm with center pin positive. Digi-Key part # L6R06H-120 2V 6W AC/DC External Wall Mount (Class II) Adapter can be used.\n","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"40187d7ae550505dd4a7d3ebfc4c93e9","permalink":"http://factoryoptic.github.io/getting-started/connections/","publishdate":"2021-03-15T23:37:51Z","title":"Connections"},{"content":"SYNCRO-LINK Display The display has a single page for showing the following information\n On the top bar  UDP will indicate whenever UDP packets are streaming Firmware version is shown on the right   On the left  ip address of SYNCRO-LINK ip address of destination server port on destination server  DHCP will show next to port if DHCP has been configured   mac address of SYNCRO-LINK   On the right  SYNC input format  Note, for UHD/4K, cameras will typically accept 1080 formats as Tri-Level sync for resolutions above 1080 do not exist. When SYNC is not present, this line will go blank For any formats not supported, the format will be surrounded by *, for example *1080P/60*   LTC/Timecode  This should appear and change every frame when timecode is present When timecode is no longer connected, the last timecode received will show   Lens Name  This is the name provided by the lens data connection This line will go blank when lens connection is removed   Focal length  This will show lens focal length in mm     Notes  During bookup, if no SD card is present, or SD card is missing config files or config files are not properly formatted, message will appear on device \u0026amp;ldquo;SD Card not present\u0026amp;rdquo;  insert card and reboot device      ","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"2e2752ae7db9e954ca772dd82cdb6c66","permalink":"http://factoryoptic.github.io/getting-started/display/","publishdate":"2021-03-15T23:37:51Z","title":"Display"},{"content":"At the moment, Factory Optic is working on an Unreal Engine Plugin that supports all the available data from the lens. This will be complted by product launch.\nIn the meantime, we are supporting an Open Source plugin.\nUE4.25 install  Download the 4.25 plugin here: http://loledvirtual.com/documentation/files/unreal/LONET-Unreal-Pluginv1.3.2binaries.zip Create a directory named \u0026amp;lsquo;plugins\u0026amp;rsquo; in your Unreal project folder, if it doens\u0026amp;rsquo;t already exist Unzip the file to the plugins directory  UE4.26 install  Download the 4.26 plugin here: http://loledvirtual.com/documentation/files/unreal/LONETClient1.4.zip Create a directory named \u0026amp;lsquo;plugins\u0026amp;rsquo; in your Unreal project folder, if it doens\u0026amp;rsquo;t already exist Unzip the file to the plugins directory  LiveLink  When you launch Unreal, open your project and open Live Link  If Live Link plugin is not installed/enabled, be sure to enable it   Add a source, select the LOLED as the source For the IP:port, you only need to specify the port, for example \u0026amp;lsquo;0.0.0.0:3200\u0026amp;rsquo; At the moment, the limitation will be only Focus, Iris and Zoom positions will be received The packet does support 6 data values to be streamed, so the other 3 values are Entrance Pupil, Near Focus Distace and Far Focus Distance.  ","date":1615852267,"description":"","lastmod":"2021-03-15T23:37:48Z","objectID":"a264d832c80b4aba3524c4cdcc0230c1","permalink":"http://factoryoptic.github.io/getting-started/unreal/","publishdate":"2021-03-15T23:37:51Z","title":"Unreal Engine"}]